<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"fbbf90ad94723ab0b6250017c284838be334d79fb21f412a02365cfa3d02bb3d","plan_job_ref":"Job Pull Request Checks #4989 at https://github.com/GSA-TTS/FAC/actions/runs/16593528957","plan_out_hash":"bb02b9093e8956033ea4625cf9c692a66f4f75d2877a2963df869bbd3f4e7d7c","plan_hash":"806f486ebd1621e56a0ca5d760e363464793eebb1afbe71e167a31996fba9f4a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 7 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "23cd75fe-c912-44e7-8999-4686eae30d72" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "23cd75fe-c912-44e7-8999-4686eae30d72" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:12026a37f8869070bd84edc785097c16bf11308b9ea31efa0f27512bfb97b25f" -> "ghcr.io/gsa-tts/fac/clamav@sha256:92de1213a6acc4f94bd7f7e02b40af2a496f914ed5c27dc86ba81aca50829cdf"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-23T10:39:13Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-07-23T14:49:18Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:12026a37f8869070bd84edc785097c16bf11308b9ea31efa0f27512bfb97b25f" -> "ghcr.io/gsa-tts/fac/clamav@sha256:92de1213a6acc4f94bd7f7e02b40af2a496f914ed5c27dc86ba81aca50829cdf"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-23T10:39:13Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-               app_process_type = "web" -> null
-               id               = "203269d4-78a2-425f-bbac-2f96bd76b378" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-04-21T19:51:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
-               app_process_type = "web" -> null
-               id               = "30a66a16-c49b-4a94-9fa9-005e6111cee8" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "e3b8a1ca-bada-461c-9252-e25244c141d4"
!~      updated_at   = "2025-07-17T10:39:11Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4989](https://github.com/GSA-TTS/FAC/actions/runs/16593528957)